import { gibun } from './index';

async function test() {
  await gibun.setSeed(`
    吾輩わがはいは猫である。名前はまだ無い。
    どこで生れたかとんと見当けんとうがつかぬ。
    何でも薄暗いじめじめした所でニャーニャー泣いていた事だけは記憶している。
    吾輩はここで始めて人間というものを見た。
    しかもあとで聞くとそれは書生という人間中で一番獰悪どうあくな種族であったそうだ。
    この書生というのは時々我々を捕つかまえて煮にて食うという話である。
    しかしその当時は何という考もなかったから別段恐しいとも思わなかった。
    ただ彼の掌てのひらに載せられてスーと持ち上げられた時何だかフワフワした感じがあったばかりである。
    掌の上で少し落ちついて書生の顔を見たのがいわゆる人間というものの見始みはじめであろう。
  `);

  const result = gibun.generate(10);
  console.log(result);
}

test();
